In [1]:

import pandas as pd

In [2]:
df = pd.read_csv('titles.csv')
df.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [7]:
df2 = df.sort_values('year')

In [8]:
df2.head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### What are the earliest two films listed in the titles dataframe?

In [3]:
df.head(2)

                title  year
0  Tasveer Mere Sanam  1996
1            Only You  1994

### How many movies have the title "Hamlet"?

In [18]:
df['title'].value_counts()["Hamlet"]

20

In [ ]:
# Total Hamlet movies are 20

### How many movies are titled "North by Northwest"?

In [17]:
df['title'].value_counts()["North by Northwest"]

1

### When was the first movie titled "Hamlet" made?

In [21]:
first = df2[df2['title']=="Hamlet"]
first.head(1)

        title  year
52521  Hamlet  1910

In [ ]:
# In year 1910 First time the Hamlet was Made

### List all of the "Treasure Island" movies from earliest to most recent.

In [22]:
df2[df2['title']=="Treasure Island"]

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [45]:
 df2[df2['year']==1950].count()

title    1113
year     1113
dtype: int64

In [46]:
# hence total movies in 1950 were 1113

### How many movies were made in the year 1960?

In [48]:
 df2[df2['year']==1960, ].count()

title    1549
year     1549
dtype: int64

In [49]:
# Hence totalmovies in year 1960 were 1549

### How many movies were made from 1950 through 1959?

### In what years has a movie titled "Batman" been released?

In [53]:
df2[df2['title']=="Batman"]

         title  year
39349   Batman  1943
240896  Batman  1989

In [54]:
# In 1943 and 1989 Batman was released

In [6]:
import pandas as pd
roles = pd.read_csv("cast.csv")

date = pd.read_csv("release_dates.csv")

roles.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [7]:

date.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

### How many roles were there in the movie "Inception"?

In [13]:
inception = roles[roles['title']=="Inception"]
inception.name.value_counts().sum()

78

In [14]:
# There were 78 roles in Inception

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [19]:
inception['n'].isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [21]:
inception['n'].sum()

1326.0

In [23]:
#total roles in the movie "Inception" did receive an "n" value are  = 
1326 - 27

1299

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [36]:
nbn = roles[roles['title']=="North by Northwest"]

In [41]:
nbn2 = nbn.sort_values('n')

In [44]:
nbn2[['name','n']]

                        name    n
871426            Cary Grant  1.0
3518333      Eva Marie Saint  2.0
1457165          James Mason  3.0
3157232  Jessie Royce Landis  4.0
356707        Leo G. Carroll  5.0
...                      ...  ...
3441077      Maudie Prickett  NaN
3577128          Doris Singh  NaN
3599912         Helen Spring  NaN
3739133        Susan Whitney  NaN
3751311       Paula Winslowe  NaN

[116 rows x 2 columns]

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [50]:
 x=roles[roles['title']=="Sleuth"] 
 x.head()

         title  year                 name   type          character    n
260242  Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
326773  Sleuth  1972        Michael Caine  actor        Milo Tindle  2.0
326774  Sleuth  2007        Michael Caine  actor             Andrew  1.0
373876  Sleuth  1972       Alec Cawthorne  actor  Inspector Doppler  3.0
373877  Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN

In [58]:
z = x[x['year']==1972]
z[['title','year','name']]

          title  year                name
326773   Sleuth  1972       Michael Caine
373876   Sleuth  1972      Alec Cawthorne
1448690  Sleuth  1972        Teddy Martin
1465483  Sleuth  1972  John (II) Matthews
1705394  Sleuth  1972    Laurence Olivier
2724553  Sleuth  1972  Eve (III) Channing

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [54]:
y = x[x['year']==2007]

In [57]:
y[['title','year','name']]

          title  year                 name
260242   Sleuth  2007      Kenneth Branagh
326774   Sleuth  2007        Michael Caine
373877   Sleuth  2007  Alec (II) Cawthorne
1293634  Sleuth  2007             Jude Law
1805907  Sleuth  2007        Harold Pinter
2724552  Sleuth  2007    Eve (II) Channing
3370424  Sleuth  2007    Carmel O'Sullivan

### How many roles were credited in the silent 1921 version of Hamlet?

In [65]:
hamlet = roles[roles['title']=="Hamlet"]
hamlet

          title  year              name     type              character     n
1731     Hamlet  1996        Riz Abbasi    actor  Attendant to Claudius   1.0
7789     Hamlet  1921  Fritz Achterberg    actor            Fortinbras,   9.0
11728    Hamlet  2009      Hayden Adams    actor                Laertes   7.0
11729    Hamlet  2009      Hayden Adams    actor                 Player   7.0
14493    Hamlet  1913       Eric Adeney    actor               Reynaldo  14.0
...         ...   ...               ...      ...                    ...   ...
3673234  Hamlet  1969    Jennifer Tudor  actress             Court lady  23.0
3697397  Hamlet  2000      Diane Venora  actress               Gertrude   3.0
3728751  Hamlet  1996     Perdita Weeks  actress          Second Player  44.0
3733637  Hamlet  2015   Katie (II) West  actress                Ophelia   7.0
3751232  Hamlet  1996      Kate Winslet  actress                Ophelia  46.0

[342 rows x 6 columns]

In [63]:
hamyear = hamlet[hamlet['year']==1921]
hamyear.character.value_counts()

Polonius            1
Horatio             1
Hamlet              1
Ophelia             1
Fortinbras,         1
Laertes             1
K?nig Hamlet        1
K?nigin Gertrude    1
Claudius            1
Name: character, dtype: int64

In [64]:
hamyear.character.value_counts().sum()

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [67]:
hamyear = hamlet[hamlet['year']==1996]
hamyear.character.value_counts().sum()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [74]:
hroles = hamlet[hamlet['character']=="Hamlet"]
hroles.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [75]:
hroles['character'].value_counts()

Hamlet    18
Name: character, dtype: int64

### How many people have played an "Ophelia"?

In [76]:
ophelia = roles[roles['title']=="Ophelia"]

In [77]:
ophelia.name.value_counts()

Naomi Watts           2
George MacKay         1
Devon Terrell         1
Veronika Strapkov?    1
Daisy Head            1
Anna Rust             1
Tom Felton            1
Clive Owen            1
Booda                 1
Noel Czuczor          1
Angela Nwagbo         1
Adriana Hercigonja    1
Dominic Mafham        1
Rupesh Tillu          1
Issy Stewart          1
Daisy Ridley          1
Mia Quiney            1
Sebastian De Souza    1
Lenka Olsanov?        1
Name: name, dtype: int64

In [78]:
ophelia.name.value_counts().sum()

20

### How many people have played a role called "The Dude"?

In [86]:
dude = roles[roles['character']=="The Dude"]

In [89]:
dude.name.value_counts().sum()

19

### How many people have played a role called "The Stranger"?

In [90]:
stranger = roles[roles['title']=="The Stranger"]

In [96]:
stranger.name.value_counts().sum()

106

### How many roles has Sidney Poitier played throughout his career?

In [97]:
sidney = roles[roles['name']=="Sidney Poitier"]

In [99]:
sidney.name.value_counts()

Sidney Poitier    43
Name: name, dtype: int64

### How many roles has Judi Dench played?

In [100]:
judi = roles[roles['name']=="Judi Dench"]

In [101]:
judi.name.value_counts()

Judi Dench    55
Name: name, dtype: int64

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [113]:
nineteen = roles[roles['year']==1940]

In [114]:
cary = nineteen[nineteen['name']=="Cary Grant"]

In [115]:
cary[cary['n']==2]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?